# Первичный анализ данных с R

In [1]:
df <- read.csv('adult.data.csv')

1. Сколько мужчин и женщин (признак sex) представлено в этом наборе данных?

In [2]:
table(df$sex)

Female   Male
 10771  21790

2. Каков средний возраст (признак age) женщин?

In [3]:
mean(df[df['sex'] == 'Female', 'age'])

[1] 36.85823

3. Какова доля граждан Германии (признак native-country)?

In [4]:
prop.table(table(df$native.country))['Germany']

    Germany
0.004207487

4-5. Каковы средние значения и среднеквадратичные отклонения возраста тех, 
кто получает более 50K в год (признак salary) и тех, кто получает менее 50K в год?

In [5]:
library(dplyr)
df %>% group_by(salary) %>%
  summarise(n = n(),
            mean = mean(age),
            std = sd(age))

Warning message:
"package 'dplyr' was built under R version 3.5.3"
Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

  salary n     mean     std
1 <=50K  24720 36.78374 14.02009
2 >50K    7841 44.24984 10.51903

6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? 
(признак education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate)

In [6]:
table(df$education, df$salary)
addmargins(table(df$education, df$salary))
prop.table(table(df$education, df$salary))

               <=50K >50K
  10th           871   62
  11th          1115   60
  12th           400   33
  1st-4th        162    6
  5th-6th        317   16
  7th-8th        606   40
  9th            487   27
  Assoc-acdm     802  265
  Assoc-voc     1021  361
  Bachelors     3134 2221
  Doctorate      107  306
  HS-grad       8826 1675
  Masters        764  959
  Preschool       51    0
  Prof-school    153  423
  Some-college  5904 1387

               <=50K >50K Sum
  10th           871   62   933
  11th          1115   60  1175
  12th           400   33   433
  1st-4th        162    6   168
  5th-6th        317   16   333
  7th-8th        606   40   646
  9th            487   27   514
  Assoc-acdm     802  265  1067
  Assoc-voc     1021  361  1382
  Bachelors     3134 2221  5355
  Doctorate      107  306   413
  HS-grad       8826 1675 10501
  Masters        764  959  1723
  Preschool       51    0    51
  Prof-school    153  423   576
  Some-college  5904 1387  7291
  Sum          24720 7841 32561

                      <=50K         >50K
  10th         0.0267497927 0.0019041184
  11th         0.0342434200 0.0018426952
  12th         0.0122846350 0.0010134824
  1st-4th      0.0049752772 0.0001842695
  5th-6th      0.0097355732 0.0004913854
  7th-8th      0.0186112220 0.0012284635
  9th          0.0149565431 0.0008292129
  Assoc-acdm   0.0246306932 0.0081385707
  Assoc-voc    0.0313565308 0.0110868831
  Bachelors    0.0962501152 0.0682104358
  Doctorate    0.0032861399 0.0093977458
  HS-grad      0.2710604711 0.0514419090
  Masters      0.0234636528 0.0294524124
  Preschool    0.0015662910 0.0000000000
  Prof-school  0.0046988729 0.0129910015
  Some-college 0.1813212125 0.0425969718

7. Выведите статистику возраста для каждой расы (признак race) и каждого пола.
Используйте groupby и describe. Найдите таким образом максимальный возраст мужчин расы Amer-Indian-Eskimo.

In [7]:
races = unique(df$race)
len = length(races)
for(i in 1:len){
	result1 = summary(df[df$sex == 'Male' & df$race == races[i], 'age'])
	result2 = summary(df[df$sex == 'Female' & df$race == races[i], 'age'])
	print(races[i])
	print(result1)
	print(result2)
}

[1] White
Levels: Amer-Indian-Eskimo Asian-Pac-Islander Black Other White
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   29.00   38.00   39.65   49.00   90.00
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   25.00   35.00   36.81   46.00   90.00
[1] Black
Levels: Amer-Indian-Eskimo Asian-Pac-Islander Black Other White
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   27.00   36.00   37.68   46.00   90.00
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   28.00   37.00   37.85   46.00   90.00
[1] Asian-Pac-Islander
Levels: Amer-Indian-Eskimo Asian-Pac-Islander Black Other White
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  18.00   29.00   37.00   39.07   46.00   90.00
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   25.00   33.00   35.09   43.75   75.00
[1] Amer-Indian-Eskimo
Levels: Amer-Indian-Eskimo Asian-Pac-Islander Black Other White
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   28.00   35.00   37.21   45.00   82.00
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   27.00   36.00   37.12   46.00   80.00
[1] Other
Levels: Amer-Indian-Eskimo Asian-Pac-Islander Black Other White
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   26.00   32.00   34.65   42.00   77.00
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   23.00   29.00   31.68   39.00   74.00

In [8]:
summary(df[df$sex == 'Male' & df$race == "Amer-Indian-Eskimo", 'age'])

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  17.00   28.00   35.00   37.21   45.00   82.00

8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак marital-status)?
Женатыми считаем тех, у кого marital-status начинается с Married (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми

In [9]:
data<- subset(df, df$sex == 'Male',select = c('sex',"marital.status","salary"))
table(data$marital.status, data$salary)
addmargins(table(data$marital.status, data$salary))
prop.table(table(data$marital.status, data$salary))

                        <=50K >50K
  Divorced               1487  284
  Married-AF-spouse         5    4
  Married-civ-spouse     7381 5938
  Married-spouse-absent   190   23
  Never-married          5591  325
  Separated               345   49
  Widowed                 129   39

                        <=50K >50K Sum
  Divorced               1487  284  1771
  Married-AF-spouse         5    4     9
  Married-civ-spouse     7381 5938 13319
  Married-spouse-absent   190   23   213
  Never-married          5591  325  5916
  Separated               345   49   394
  Widowed                 129   39   168
  Sum                   15128 6662 21790

                               <=50K         >50K
  Divorced              0.0682423130 0.0130335016
  Married-AF-spouse     0.0002294631 0.0001835704
  Married-civ-spouse    0.3387333639 0.2725103258
  Married-spouse-absent 0.0087195961 0.0010555301
  Never-married         0.2565855897 0.0149150987
  Separated             0.0158329509 0.0022487380
  Widowed               0.0059201469 0.0017898118

9. Какое максимальное число часов человек работает в неделю (признак hours-per-week)? 
Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?

In [10]:
max(df$hours.per.week)

table(df$hours.per.week == 99, df$salary)
addmargins(table(df$hours.per.week == 99, df$salary))
prop.table(table(df$hours.per.week == 99, df$salary))

[1] 99

        <=50K  >50K
  FALSE 24660  7816
  TRUE     60    25

        <=50K >50K Sum
  FALSE 24660 7816 32476
  TRUE     60   25    85
  Sum   24720 7841 32561

               <=50K         >50K
  FALSE 0.7573477473 0.2400417678
  TRUE  0.0018426952 0.0007677897

10. Посчитайте среднее время работы (hours-per-week) зарабатывающих мало и много (salary) для каждой страны (native-country).

In [11]:
countries = unique(df$native.country)
len = length(countries)
for(i in 1:len){
	result1 = mean(df$hours.per.week[df$salary == '>50K' & df$native.country == countries[i]])
	result2 = mean(df$hours.per.week[df$salary == '<=50K' & df$native.country == countries[i]])
	print(countries[i])
	print(result1)
	print(result2)
}

[1] United-States
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 45.50537
[1] 38.79913
[1] Cuba
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 42.44
[1] 37.98571
[1] Jamaica
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 41.1
[1] 38.23944
[1] India
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 46.475
[1] 38.23333
[1] ?
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 45.54795
[1] 40.16476
[1] Mexico
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 46.57576
[1] 40.00328
[1] South
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 51.4375
[1] 40.15625
[1] Puerto-Rico
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 39.41667
[1] 38.47059
[1] Honduras
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 60
[1] 34.33333
[1] England
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 44.53333
[1] 40.48333
[1] Canada
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 45.64103
[1] 37.91463
[1] Germany
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 44.97727
[1] 39.13978
[1] Iran
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 47.5
[1] 41.44
[1] Philippines
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 43.03279
[1] 38.06569
[1] Italy
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 45.4
[1] 39.625
[1] Poland
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 39
[1] 38.16667
[1] Columbia
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 50
[1] 38.68421
[1] Cambodia
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 40
[1] 41.41667
[1] Thailand
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 58.33333
[1] 42.86667
[1] Ecuador
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 48.75
[1] 38.04167
[1] Laos
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 40
[1] 40.375
[1] Taiwan
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 46.8
[1] 33.77419
[1] Haiti
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 42.75
[1] 36.325
[1] Portugal
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 41.5
[1] 41.93939
[1] Dominican-Republic
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 47
[1] 42.33824
[1] El-Salvador
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 45
[1] 36.03093
[1] France
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 50.75
[1] 41.05882
[1] Guatemala
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 36.66667
[1] 39.36066
[1] China
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 38.9
[1] 37.38182
[1] Japan
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 47.95833
[1] 41
[1] Yugoslavia
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 49.5
[1] 41.6
[1] Peru
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 40
[1] 35.06897
[1] Outlying-US(Guam-USVI-etc)
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] NaN
[1] 41.85714
[1] Scotland
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 46.66667
[1] 39.44444
[1] Trinadad&Tobago
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 40
[1] 37.05882
[1] Greece
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 50.625
[1] 41.80952
[1] Nicaragua
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 37.5
[1] 36.09375
[1] Vietnam
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 39.2
[1] 37.19355
[1] Hong
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 45
[1] 39.14286
[1] Ireland
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 48
[1] 40.94737
[1] Hungary
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] 50
[1] 31.3
[1] Holand-Netherlands
42 Levels: ? Cambodia Canada China Columbia Cuba Dominican-Republic ... Yugoslavia
[1] NaN
[1] 40